ci4/app/Controllers/Artikel.php

    public function index()
    {
        $title = 'Daftar Artikel';
        $model = new ArtikelModel();
        $kategoriModel = new KategoriModel();

        $kategori_id = $this->request->getVar('kategori_id') ?? '';

        $builder = $model->table('artikel')
            ->select('artikel.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori');

        if (!empty($kategori_id)) {
            $builder->where('artikel.id_kategori', $kategori_id);
        }

        $artikel = $builder->get()->getResultArray();
        $kategori = $kategoriModel->findAll();
---
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`id_kategori` = '1'
SELECT *
FROM `kategori`

    public function admin_index()
    {
        $title = 'Daftar Artikel (Admin)';
        $model = new ArtikelModel();

        $q = $this->request->getVar('q') ?? '';
        $kategori_id = $this->request->getVar('kategori_id') ?? '';
        $page = $this->request->getVar('page') ?? 1;

        // Query builder dengan join kategori
        $builder = $model->table('artikel')
                         ->select('artikel.*, kategori.nama_kategori')
                         ->join('kategori', 'kategori.id_kategori = artikel.id_kategori');

        if ($q != '') {
            $builder->like('artikel.judul', $q);
        }

        if ($kategori_id != '') {
            $builder->where('artikel.id_kategori', $kategori_id);
        }

        $artikel = $builder->paginate(10, 'default', $page);
---
SELECT *
FROM `kategori`
SELECT COUNT(*) AS `numrows`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
 LIMIT 10

            return $this->response->setJSON($data);
        } else {
            $kategoriModel = new KategoriModel();
            $data['kategori'] = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`

    public function add()
    {
        $validation = \Config\Services::validation();

        $rules = [
            'judul'       => 'required',
            'id_kategori' => 'required|integer',
        ];

        if ($this->request->getMethod() == 'POST' && $this->validate($rules)) {
            $model = new ArtikelModel();

            $gambar = null;
            $file = $this->request->getFile('gambar');
            if ($file && $file->isValid() && !$file->hasMoved()) {
                $file->move(ROOTPATH . 'public/gambar');
                $gambar = $file->getName();
            }

            $model->insert([
                'judul'       => $this->request->getPost('judul'),
                'isi'         => $this->request->getPost('isi'),
                'slug'        => url_title($this->request->getPost('judul'), '-', true),
                'gambar'      => $gambar,
                'id_kategori' => $this->request->getPost('id_kategori'),
            ]);

            return redirect()->to('/admin/artikel');
        } else {
            $kategoriModel = new KategoriModel();
            $kategori = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`

    public function edit($id)
    {
        $model = new ArtikelModel();

        $rules = [
            'judul'       => 'required',
            'id_kategori' => 'required|integer',
        ];

        if ($this->request->getMethod() == 'POST' && $this->validate($rules)) {
            $updateData = [
                'judul'       => $this->request->getPost('judul'),
                'isi'         => $this->request->getPost('isi'),
                'id_kategori' => $this->request->getPost('id_kategori'),
                'slug'        => url_title($this->request->getPost('judul'), '-', true),
            ];

            $file = $this->request->getFile('gambar');
            if ($file && $file->isValid() && !$file->hasMoved()) {
                $file->move(ROOTPATH . 'public/gambar');
                $updateData['gambar'] = $file->getName();
            }

            $model->update($id, $updateData);
            return redirect()->to('/admin/artikel');
        } else {
            $artikel = $model->find($id);
            $kategoriModel = new KategoriModel();
            $kategori = $kategoriModel->findAll();
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '1'
SELECT *
FROM `kategori`