ci4/app/Controllers/Post.php

    public function show($id = null)
{
        $model = new ArtikelModel();
        $data = $model->where('id', $id)->first();
---
SELECT *
FROM `artikel`
WHERE `id` = '2'
 LIMIT 1